In [1]:
import pandas as pd

In [2]:
q_df=pd.DataFrame([['male','teacher'],['male','engineer'],['female',None],['female',None
],['female','engineer']],columns=['Sex','Profession'])

In [3]:
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female       None
3  female       None
4  female   engineer

In [14]:
new_q_df=q_df.fillna('others')

In [15]:
new_q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female     others
3  female     others
4  female   engineer

In [16]:
label_q_df=pd.get_dummies(new_q_df[['Sex','Profession']])

In [17]:
label_q_df=pd.concat([new_q_df,label_q_df],axis=1)

In [18]:
label_q_df

,Sex,Profession,Sex_female,Sex_male,Profession_engineer,Profession_others,Profession_teacher
0,male,teacher,0,1,0,0,1
1,male,engineer,0,1,1,0,0
2,female,others,1,0,0,1,0
3,female,others,1,0,0,1,0
4,female,engineer,1,0,1,0,0